In [1]:
import pandas as pd

In [4]:
pd.read_csv("https://raw.githubusercontent.com/adamjanes/udemy-d3/master/02/2.07/data/ages.csv")

      name  age
0     Tony   10
1  Jessica   12
2   Andrew    9
3    Emily   10
4  Richard   11

In [16]:
pd.read_csv("https://raw.githubusercontent.com/adamjanes/udemy-d3/master/02/2.07/data/ages.csv")

      name  age
0     Tony   10
1  Jessica   12
2   Andrew    9
3    Emily   10
4  Richard   11

In [6]:
pd.read_csv("dados/dados.csv")

      name  age
0     Tony   10
1  Jessica   12
2   Andrew    9
3    Emily   10
4  Richard   11

In [7]:
df = pd.read_csv("dados/dados.csv")

In [8]:
df

      name  age
0     Tony   10
1  Jessica   12
2   Andrew    9
3    Emily   10
4  Richard   11

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.to_csv("dados/outrodado.csv")

In [11]:
df.to_csv("dados/outrodado.csv", sep=';')

In [12]:
df.to_csv("dados/outrodado.csv", sep=';', index=False, header=False)

In [14]:
pd.read_csv("dados/outrodado.csv")

      Tony;10
0  Jessica;12
1    Andrew;9
2    Emily;10
3  Richard;11

In [13]:
pd.read_csv("dados/outrodado.csv", sep=';', names=["name", "age"])

      name  age
0     Tony   10
1  Jessica   12
2   Andrew    9
3    Emily   10
4  Richard   11

In [14]:
df = pd.read_csv("dados/outrodado.csv", sep=';', names=["name", "age"])

In [15]:
df

      name  age
0     Tony   10
1  Jessica   12
2   Andrew    9
3    Emily   10
4  Richard   11